### Reading and writing data in text format

In [14]:
!mkdir examples

A subdirectory or file examples already exists.

### to create a file use %%file path\filename

In [11]:
%%file examples/ex1.csv
a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

Overwriting examples/ex1.csv

In [12]:
import pandas as pd
df = pd.read_csv('examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
%%file examples/ex2.csv
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

Writing examples/ex2.csv

In [18]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [19]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [20]:
names=['a', 'b', 'c', 'd', 'message']
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

#### Heirarchical indexing of columns

In [22]:
%%file examples/csv_mindex.csv
key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

Overwriting examples/csv_mindex.csv

In [23]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [30]:
%%file examples/ex3.txt
idx         A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

Overwriting examples/ex3.txt

In [32]:
list(open('examples/ex3.txt'))

['idx         A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [37]:
result = pd.read_table('examples/ex3.txt', sep='/s+', engine='python') #/s+ indicates variable amount of whitespace
result

   idx         A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [40]:
%%file examples/ex4.csv
hey!
a,b,c,d,message
just wanted to make things more difficult for you
who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

Writing examples/ex4.csv

In [41]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [42]:
%%file examples/ex5.csv
something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

Writing examples/ex5.csv

In [44]:
result = pd.read_csv('examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [45]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [46]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [47]:
sentinels = {'message':['foo', 'NA'], 'something':['two']}
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### Reading text files in pieces

We can do the above by specifiying the 'chunksize=', when we specify this parameter we are returned a text parser object that
allows us to iterate according to the chunk size

### Writing data to text format

In [1]:
import pandas as pd
data = pd.read_csv('examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [2]:
data.to_csv('examples/out.csv')

In [7]:
!type examples\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [8]:
import sys
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [9]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [10]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [11]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [13]:
# to_csv also can be used for a series
dates = pd.date_range('1/1/2000', periods=7)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [14]:
import numpy as np
ts = pd.Series(np.arange(7), index=dates)
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [15]:
ts.to_csv('examples/tseries.csv')

In [16]:
!type examples\tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

### Working with delimited formats
i.e., delimited files only have a delimiter and unlike csv files, it does not have enclosing charcters for each value (eg: "")

In [17]:
%%file examples/ex7.csv
"a","b","c"
"1","2","3"
"1","2","3"

Writing examples/ex7.csv

In [18]:
import csv
f = open('examples/ex7.csv')
reader = csv.reader(f) # csv.reader() used to return an object to the file you want to read

In [19]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [21]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [23]:
header, values = lines[0], lines[1:]
header, values

(['a', 'b', 'c'], [['1', '2', '3'], ['1', '2', '3']])

In [24]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

To create a new CSV file format we define a subclass of csv.Dialect

In [34]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
with open('examples/ex7.csv') as f:
    reader = csv.reader(f, dialect = my_dialect)
    for lines in reader:
        print(lines)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

In [35]:
with open('examples/mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

In [36]:
!type examples\mydata.csv

one;two;three
1;2;3
4;5;6
7;8;9

### JSON data
Used for data transfer in web apps and HTTP

In [37]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
 {"name": "Katie", "age": 38,
 "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [38]:
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [39]:
as_json = json.dumps(result) # converts python form to json form

In [41]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age', 'pets'])
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

In [42]:
%%file examples/example.json
[{"a": 1, "b": 2, "c": 3},
{"a": 4, "b": 5, "c": 6},
{"a": 7, "b": 8, "c": 9}]

Writing examples/example.json

In [43]:
data = pd.read_json('examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [44]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [45]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### HTML and XML: Web scraping

In [4]:
import pandas as pd
tables = pd.read_html('examples/fdic_failed_bank_list.html')
len(tables)

1

In [5]:
failures = tables[0]

In [6]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [7]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [8]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

In [10]:
from lxml import objectify
path = 'examples/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot() # to get a refrence to the root node of the xml file

In [12]:
data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ', 'DESIRED_CAHNGE', 'DECIMAL_PLACES']
for elt in root:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [13]:
perf = pd.DataFrame(data)
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,DESIRED_CHANGE,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,Escalator Availability,Percent of the time that escalators are operat...,2011,12,Service Indicators,M,U,%,97.0,,97.0,

In [14]:
# to access any of the fields of the tags, here fir the anchor tag we can access the href and the text within tha tag
from io import StringIO
tag = '<a href="https://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [15]:
root

In [16]:
root.get('href')

'https://www.google.com'

In [21]:
root.text

'Google'

### Binary Data Formats

In [22]:
# storing data effeciently in binary - serialization. It is to be used temporarily as it is not very stable

In [24]:
frame = pd.read_csv('examples/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [25]:
frame.to_pickle('examples/frame_pickle')

In [26]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### Using the HDF5 Format
Stands for Hierarchical Data Format. For storing large quantities of scientific array data

In [27]:
import numpy as np
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [29]:
store['obj1']

           a
0   1.051209
1   0.965436
2  -0.054289
3   0.489555
4   2.910773
..       ...
95 -0.427952
96  1.092181
97 -0.004763
98 -0.568519
99  0.346181

[100 rows x 1 columns]

In [31]:
store.put('obj2', frame, format='table') # if we format as table then we can use query operations like given below
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -1.260738
11 -0.930138
12 -0.729868
13 -2.094548
14  0.728872
15  0.251608

In [32]:
store.close()

In [34]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [36]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  1.051209
1  0.965436
2 -0.054289
3  0.489555
4  2.910773

### Reading microsoft excel files

In [38]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [40]:
frame = pd.read_excel(xlsx, 'Sheet1')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [41]:
# to write data
writer = pd.ExcelWriter('examples/ex2.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.save()

In [42]:
# instead of the above we do the below
frame.to_excel('examples/ex2.xlsx')

### Interacting with Web APIs

In [43]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [44]:
data = resp.json()
data[0]['title']

'ENH: add `regex=False` option to pandas.Series.str.match and fullmatch (like in str.contains)'

In [45]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])
issues

,number,title,labels,state
0,48086,ENH: add `regex=False` option to pandas.Series...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
1,48085,ENH: Add axis parameter to add_prefix and add_...,[],open
2,48084,ENH: alleviate issues with inconsistent multi-...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
3,48083,BUG: pd.cut creates NaNs instead of expected b...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
4,48082,REF: avoid internals in merge code,[],open
5,48081,ENH: Add support for groupby.ohlc for ea dtypes,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
6,48080,PDEP-3: Small data visualization consolidation,"[{'id': 2301354, 'node_id': 'MDU6TGFiZWwyMzAxM...",open
7,48079,ENH: Move column levels in multi column index ...,"[{'id': 34444536, 'node_id': 'MDU6TGFiZWwzNDQ0...",open
8,48078,ENH: Support mask for groupby var and mean,[],open
9,48077,Bug: Unexpected behavior when assigning multi-...,[],open
10,48075,TST: Address test warnings,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
11,48073,DEPR: `sort_columns` in `plot` (#47563),[],open
12,48072,TST: Check dtype in test_resample_empty_dataframe,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
13,48071,ENH: Avoid casting to int64/uint64 for GroupBy...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
14,48070,ENH: Support mask in GroupBy.cumsum,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
15,48067,TST: Check index when grouping all columns of ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
16,48066,CI: Avoid flaky build errors & show installed ...,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
17,48064,BUG: Groupby cumprod nan influences other colu...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
18,48063,fixed docstring error with pandas.Series.plot....,"[{'id': 2413328, 'node_id': 'MDU6TGFiZWwyNDEzM...",open
19,48062,REF: make copy keyword non-stateful,"[{'id': 127681, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
20,48060,"DOC: ""Creating a Python environment"" in ""Creat...","[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
21,48058,REGR: fix reset_index (Index.insert) regressio...,"[{'id': 32815646, 'node_id': 'MDU6TGFiZWwzMjgx...",open
22,48057,REGR: fix regression in scalar setitem with se...,"[{'id': 2822098, 'node_id': 'MDU6TGFiZWwyODIyM...",open
23,48056,BUG: Rolling operations on groupby with apply ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
24,48055,"Fixed docstring error with style.py, unknown p...","[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
25,48052,BUG: Weird Behavior of astype(bool) for np.nan,"[{'id': 2822342, 'node_id': 'MDU6TGFiZWwyODIyM...",open
26,48051,REF: dont alter self in _validate_specification,"[{'id': 127681, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
27,48050,ENH: allow user to infer SAS file encoding; ad...,"[{'id': 258745163, 'node_id': 'MDU6TGFiZWwyNTg...",open
28,48048,ENH: Add option to `read_sas` to infer encodin...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
29,48046,CI: setuptools 64.0.0 breaks our builds,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open

### Interacting with Databases

In [46]:
import sqlite3
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER
);"""

In [47]:
con = sqlite3.connect('mydata.sqlite')

In [48]:
con.execute(query)

In [49]:
con.commit()

In [50]:
data = [('Atlanta', 'Georgia', 1.25, 6), ('Tallahassee', 'Florida', 2.6, 3), ('Sacramento', 'California', 1.7, 5)]

In [51]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)

In [52]:
con.commit()

In [53]:
cursor = con.execute("SELECT * FROM test")

In [54]:
rows = cursor.fetchall()

In [55]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [56]:
cursor.description # column names is contained in the description attribute

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [58]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [59]:
# instead of executing queries each time we require data, we can use SQLAlchemy project which uses pandas to read data easily
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('SELECT * FROM test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5